{
  "metadata": {
    "timestamp": "2025-07-13T18:23:15.523Z",
    "fighterA": {
      "name": "a brown field mouse",
      "imageUrl": "/vs/fighters/mouse-1752430062405-vnuhjm.jpg",
      "stats": {
        "health": 30,
        "maxHealth": 30,
        "strength": 2,
        "luck": 15,
        "agility": 85,
        "defense": 10,
        "age": 6,
        "size": "small",
        "build": "thin"
      },
      "description": "a sun-drenched meadow filled with wildflowers, bordered by a crumbling stone wall overgrown with ivy. worn leather boots small wooden flute scattered wildflower petals a brown field mouse, standing alert and tense quiet and watchful, with an underlying sense of vulnerability and potential threat. the mouse clutches a tiny, tarnished button in its paws. a hawk circles high above the meadow."
    },
    "fighterB": {
      "name": "Godzilla",
      "imageUrl": "/vs/fighters/download (3)-1752430165221-2m7kin.jpg",
      "stats": {
        "health": 1000,
        "maxHealth": 1000,
        "strength": 200,
        "luck": 20,
        "agility": 15,
        "defense": 90,
        "age": 48765321,
        "size": "large",
        "build": "heavy"
      },
      "description": "a volcanic wasteland stretches as far as the eye can see, dominated by jagged obsidian peaks and rivers of molten rock. ash falls constantly, coating everything in a grey film. the air is thick with sulfurous fumes. large boulder scorched remains of machinery fragmented crystal shard godzilla heat haze desolate and terrifying, filled with immense destructive power and a sense of hopelessness. a faint signal emanating from the depths of an active volcano. strange energy readings detected near a collapsed research facility."
    },
    "arena": {
      "name": "Arena",
      "imageUrl": "/vs/arena/beach-stairway-1752430965874-ax8ogu.jpg",
      "description": ""
    },
    "winner": "Godzilla",
    "totalRounds": 2,
    "maxRounds": 6
  },
  "battleLog": [
    {
      "round": 1,
      "attacker": "a brown field mouse",
      "defender": "Godzilla",
      "attackCommentary": "The tiny titan unleashes a flurry of bites in a desperate hail-mary, landing a surprisingly powerful hit that registers for 800 damage against Godzilla! It's an early upset, but can.",
      "defenseCommentary": "a brown field mouse raises their guard against the incoming attack!",
      "attackerDamage": 800,
      "defenderDamage": 0,
      "randomEvent": "a brown field mouse narrowly dodges Godzilla's attack! a brown field mouse finds a weak spot and deals devastating damage!",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 30,
        "defender": 200
      }
    },
    {
      "round": 2,
      "attacker": "Godzilla",
      "defender": "a brown field mouse",
      "attackCommentary": "Godzilla levels a devastating atomic breath on the tiny brown field mouse in round two! A 322 damage strike leaves no room for comeback. The fight's getting INTOLERABLELY intense.",
      "defenseCommentary": "Round two's tension is palpable as a tiny titan like Pipkin dances on Godzilla's colossal atomic breath, every flicker a near miss in this David and Goliath showdown. The King.",
      "attackerDamage": 322,
      "defenderDamage": 0,
      "randomEvent": "Godzilla uses undefined to enhance their attack!",
      "arenaObjectsUsed": [
        null
      ],
      "healthAfter": {
        "attacker": 200,
        "defender": 0
      }
    }
  ]
}