{
  "metadata": {
    "timestamp": "2025-07-13T13:12:19.574Z",
    "fighterA": {
      "name": "brown field mouse",
      "imageUrl": "/vs/fighters/mouse-1752412249126-acvzyg.jpg",
      "stats": {
        "health": 20,
        "maxHealth": 20,
        "strength": 1,
        "luck": 19,
        "agility": 18,
        "defense": 5,
        "age": 11,
        "size": "small",
        "build": "thin"
      },
      "description": "a damp, moss-covered stone path winds through a dense forest. sunlight struggles to penetrate the canopy above, creating a perpetually twilight atmosphere. ferns and wildflowers grow in abundance along the sides of the path. worn leather boots small stone a scattering of berries brown field mouse (fighter) quiet and cautious, with an undercurrent of alertness. a sense of hidden vulnerability. the mouse clutches a tiny, sharpened pebble in its paws - a surprisingly effective weapon. a faint rustling sound comes from the bushes ahead."
    },
    "fighterB": {
      "name": "Bruce Lee",
      "imageUrl": "/vs/fighters/brcue-lee-1752412311628-li6ohs.jpg",
      "stats": {
        "health": 102,
        "maxHealth": 102,
        "strength": 14,
        "luck": 15,
        "agility": 17,
        "defense": 12,
        "age": 32,
        "size": "medium",
        "build": "muscular"
      },
      "description": "a stark, concrete training hall filled with rows of gleaming, stylized warrior statues. the lighting is harsh and directional, emphasizing the angular forms of the figures. stylized warrior statues training mat metal weights bruce lee (as a statue) focused intensity; disciplined training; controlled power. a faint shimmer around the warrior statues suggests they are not entirely inanimate. the training mat is subtly stained with what appears to be blood."
    },
    "arena": {
      "name": "Arena",
      "imageUrl": "/vs/arena/beach-stairway-1752412300013-807a0b.jpg",
      "description": ""
    },
    "winner": "brown field mouse",
    "totalRounds": 3,
    "maxRounds": 6
  },
  "battleLog": [
    {
      "round": 1,
      "attacker": "brown field mouse",
      "defender": "Bruce Lee",
      "attackCommentary": "The tiny titan charges with a flurry of clawed jabs! But can Pip squeak past Bruce Lee's legendary reflexes in this first round showdown.",
      "defenseCommentary": "brown field mouse blocks the strike with expert timing!",
      "attackerDamage": 0,
      "defenderDamage": 0,
      "randomEvent": "brown field mouse narrowly dodges Bruce Lee's attack!",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 20,
        "defender": 102
      }
    },
    {
      "round": 2,
      "attacker": "Bruce Lee",
      "defender": "brown field mouse",
      "attackCommentary": "Bruce Lee explodes forward with a lightning-fast combo! The tiny brown field mouse doesn't stand a chance as 16 damage racks up their health in this brutal opening.",
      "defenseCommentary": "Bruce Lee circles cautiously in round two, his lightning reflexes anticipating a desperate surge from the brown field mouse. Can he outmaneuver this unpredictable opponent.",
      "attackerDamage": 16,
      "defenderDamage": 0,
      "randomEvent": "",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 102,
        "defender": 4
      }
    },
    {
      "round": 3,
      "attacker": "brown field mouse",
      "defender": "Bruce Lee",
      "attackCommentary": "The pressure's on as round 3 begins! Brown Field Mouse goes for a desperate combo, but Bruce Lee flawlessly executes an explosive counter for a MAJOR damage swing and leaves.",
      "defenseCommentary": "The tiny titan squirms out of a flurry from Bruce Lee's lightning reflexes in round 3 - this is no time for overconfidence! Will Nibbles survive the onslaught.",
      "attackerDamage": 102,
      "defenderDamage": 0,
      "randomEvent": "brown field mouse fails to dodge and is knocked out!",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 4,
        "defender": 0
      }
    }
  ]
}