{
  "metadata": {
    "timestamp": "2025-07-12T15:47:28.102Z",
    "fighterA": {
      "name": "brown field mouse",
      "imageUrl": "/imgRepository/mouse-1752334815543-oprxnd.jpg",
      "stats": {
        "health": 10,
        "maxHealth": 10,
        "strength": 3,
        "luck": 15,
        "agility": 19,
        "defense": 3,
        "age": 43,
        "size": "small",
        "build": "thin"
      },
      "description": "a moss-covered stone pathway winds through a dense, overgrown forest. sunlight filters weakly through the canopy above, casting dappled shadows on the ground. the air is damp and smells of decaying leaves and rich soil. worn stone pathway scattered wildflowers a small, rusted tin can brown field mouse (fighter) quiet and contemplative, with a subtle sense of unease. the atmosphere is one of hidden secrets and potential danger. the mouse seems unusually alert, twitching its whiskers frequently. a faint rustling sound comes from the undergrowth."
    },
    "fighterB": {
      "name": "Godzilla",
      "imageUrl": "/imgRepository/download (3)-1752334916433-s61zow.jpg",
      "stats": {
        "health": 45,
        "maxHealth": 45,
        "strength": 4,
        "luck": 14,
        "agility": 15,
        "defense": 4,
        "age": 44,
        "size": "small",
        "build": "average"
      },
      "description": "a ruined temple complex stands amidst a volcanic wasteland, black sand stretching to the horizon. obsidian pillars are partially buried in ash, and steam rises from cracks in the scorched earth. cracked stone altar scattered metal weapons a pool of glowing magma godzilla (adult) scorched skeletal remains desolate, dangerous, and overwhelmingly powerful. a sense of ancient destruction and raw energy. the glowing magma seems to pulse with a strange intelligence. a faint, rhythmic drumming can be heard in the distance."
    },
    "arena": {
      "name": "Arena",
      "imageUrl": "/imgRepository/scene-castle-1-1752335189945-44t1tu.jpg",
      "description": "a medieval stone castle sits on an island in a calm lake. the castle is constructed from grey stone with rounded towers and a central keep. a wooden bridge leads to the main gate. lush green grass surrounds the base of the structure, and trees line the shoreline. the sky is overcast, suggesting a cloudy day. wooden bridge castle gates stone walls lake water tree foliage peaceful but with an underlying sense of history and potential isolation. a weathered plaque on the castle gate bears a faded inscription. the lake reflects a strange, distorted image of the castle."
    },
    "winner": "Godzilla",
    "totalRounds": 6,
    "maxRounds": 6
  },
  "battleLog": [
    {
      "round": 1,
      "attacker": "brown field mouse",
      "defender": "Godzilla",
      "attackCommentary": "Out of NOWHERE, a desperate strike from Nibbles the mouse lands! A single point of damage against the KING OF THE MONSTERS? This could be a turning point in this.",
      "defenseCommentary": "brown field mouse raises their guard against the incoming attack!",
      "attackerDamage": 1,
      "defenderDamage": 0,
      "randomEvent": "brown field mouse narrowly dodges Godzilla's attack!",
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 10,
        "defender": 44
      }
    },
    {
      "round": 2,
      "attacker": "Godzilla",
      "defender": "brown field mouse",
      "attackCommentary": "The crowd erupts as Godzilla connects with a powerful tail swipe! A measly 6 damage against a BEHEMUTH like this, but could it start to chip away at their legendary.",
      "defenseCommentary": "The tiny brown field mouse is out for survival in round two! Can they withstand Godzilla's atomic breath and survive another minute,  or will it be a devastating tail-sweep.",
      "attackerDamage": 6,
      "defenderDamage": 0,
      "randomEvent": "Godzilla uses undefined to enhance their attack!",
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 44,
        "defender": 4
      }
    },
    {
      "round": 3,
      "attacker": "brown field mouse",
      "defender": "Godzilla",
      "attackCommentary": "The tiny titan, fueled by DESPERATION, lands a measly ONE damage against Godzilla's titanic frame in Round 3! Will this nibble turn the tide of the colossus clash, or is.",
      "defenseCommentary": "Squeak's on high damage output from round 2 was a shockwave warning for the Mouse! Can he weather one more atomic breath as Godzilla presses their Round 3 advantage? .",
      "attackerDamage": 1,
      "defenderDamage": 0,
      "randomEvent": "brown field mouse narrowly dodges Godzilla's attack!",
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 4,
        "defender": 43
      }
    },
    {
      "round": 4,
      "attacker": "Godzilla",
      "defender": "brown field mouse",
      "attackCommentary": "The crowd erupts as Godzilla ignores every tiny counter and slams in a devastating atomic tail swipe! We're seeing damage accumulate on this unlikely contender - can the brown field.",
      "defenseCommentary": "The tiny titan's on edge as Round 4 kicks off - can this spectral mouse truly withstand Godzilla's atomic breath and survive a KING OF THE MONSTORS level assault? .",
      "attackerDamage": 3,
      "defenderDamage": 0,
      "randomEvent": null,
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 43,
        "defender": 1
      }
    },
    {
      "round": 5,
      "attacker": "brown field mouse",
      "defender": "Godzilla",
      "attackCommentary": "The tiny titan Mickey stands NO CHAWNCE against the atomic onslaught! A single nibble of damage for a literal mountain of radioactive scales--but will it be enough to take down.",
      "defenseCommentary": "Can little Squeak survive ONE. MORE. round against the atomic onslaught? It's a desperate dance of evasion as Godzilla presses the counter-offensive in Round 5.",
      "attackerDamage": 1,
      "defenderDamage": 0,
      "randomEvent": "brown field mouse narrowly dodges Godzilla's attack!",
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 1,
        "defender": 42
      }
    },
    {
      "round": 6,
      "attacker": "Godzilla",
      "defender": "brown field mouse",
      "attackCommentary": "The tiny titan's resilience falters! A vicious swipe connects from Godzilla in round 6, chipping away at their health with a decisive six points of damage. This could be the.",
      "defenseCommentary": "The tiny titan's on edge! Can this whirlwind of a brown field mouse withstand another round of Godzilla's atomic fury, or will they crumble before the King of Monsters in.",
      "attackerDamage": 6,
      "defenderDamage": 0,
      "randomEvent": "Godzilla uses undefined to enhance their attack!",
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 42,
        "defender": 0
      }
    }
  ]
}