{
  "metadata": {
    "timestamp": "2025-07-14T14:48:29.864Z",
    "fighterA": {
      "name": "Darius Blackwood",
      "imageUrl": "/vs/fighters/Stephen-Siegal-1752504448826-bdwp10.jpg",
      "stats": {
        "health": 120,
        "maxHealth": 120,
        "strength": 45,
        "luck": 15,
        "agility": 38,
        "defense": 30,
        "age": 35,
        "size": "medium",
        "build": "muscular"
      },
      "description": "a dimly lit tavern interior. rough-hewn wooden tables are scattered across a worn floor. the air is thick with the smells of ale, sweat, and cheap tobacco. a roaring fireplace provides the primary source of light, casting long shadows across the room. several patrons – mostly rough-looking men – sit at various tables, engaged in hushed conversations or playing dice. empty tankard dice set wooden table fireplace worn rug darius blackwood gruff bartender suspicious and tense. a sense of unease permeates the atmosphere, suggesting hidden deals or impending trouble. a hooded figure observes darius from a darkened corner. the bartender nervously wipes down the counter."
    },
    "fighterB": {
      "name": "Bruce Lee",
      "imageUrl": "/vs/fighters/brcue-lee-1752504322447-0omm0e.jpg",
      "stats": {
        "health": 120,
        "maxHealth": 120,
        "strength": 40,
        "luck": 15,
        "agility": 75,
        "defense": 35,
        "age": 30,
        "size": "medium",
        "build": "average"
      },
      "description": ""
    },
    "arena": {
      "name": "Arena",
      "imageUrl": "/vs/arena/goth-restaurant-1752500875803-8wls1o.webp",
      "description": ""
    },
    "winner": "Darius Blackwood",
    "totalRounds": 5,
    "maxRounds": 6
  },
  "battleLog": [
    {
      "round": 1,
      "attacker": "Darius Blackwood",
      "defender": "Bruce Lee",
      "attackCommentary": "Blackwood explodes out of the gate with a vicious combo, connecting on point for 61 damage in that stunning opening exchange! It's clear he means business from the start.",
      "defenseCommentary": "Blackwood's on the defensive early, narrowly dodging a flurry of Lee's iconic lightning-fast strikes. This calculated positioning could set up a counter for the spectral duelist in round two.",
      "attackerDamage": 61,
      "defenderDamage": 0,
      "randomEvent": "Darius Blackwood uses undefined in their attack!",
      "arenaObjectsUsed": [
        null
      ],
      "healthAfter": {
        "attacker": 120,
        "defender": 59
      }
    },
    {
      "round": 2,
      "attacker": "Bruce Lee",
      "defender": "Darius Blackwood",
      "attackCommentary": "The Dragon explodes into a flurry of kicks! Bruce Lee lands a brutal combination on Blackwood, staggering the Enforcer with 27 damage and claiming an early edge in this round.",
      "defenseCommentary": "Blackwood narrowly avoids a flurry of Lee's lightning-fast jabs in round two, showcasing impressive defensive reflexes as he rides the edge of annihilation.",
      "attackerDamage": 27,
      "defenderDamage": 0,
      "randomEvent": "Bruce Lee lands a critical hit!",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 59,
        "defender": 93
      }
    },
    {
      "round": 3,
      "attacker": "Darius Blackwood",
      "defender": "Bruce Lee",
      "attackCommentary": "Blackwood lands a vicious uppercut on Bruce Lee's counter, sending the legendary fighter reeling with 38 damage! This could be the decisive blow.",
      "defenseCommentary": "Blackwood's on the defensive in round three as Lee presses their legendary speed. Will Darius weather the onslaught of iconic Dragon techniques, or crumble under the pressure.",
      "attackerDamage": 38,
      "defenderDamage": 0,
      "randomEvent": "",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 93,
        "defender": 21
      }
    },
    {
      "round": 4,
      "attacker": "Bruce Lee",
      "defender": "Darius Blackwood",
      "attackCommentary": "Blackwood narrowly avoids a flurry of Jeetkune DO strikes from Bruce Lee, but those lightning-fast jabs land HARD for 37 damage in a stunning opening.",
      "defenseCommentary": "Blackwood narrowly avoids a flurry of Bruce Lee's iconic kicks in round four! Will he weather the pressure and turn the tide next.",
      "attackerDamage": 37,
      "defenderDamage": 0,
      "randomEvent": "Bruce Lee lands a critical hit!",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 21,
        "defender": 56
      }
    },
    {
      "round": 5,
      "attacker": "Darius Blackwood",
      "defender": "Bruce Lee",
      "attackCommentary": "Blackwood launches a brutal combo, connecting with a devastating 48-hit that leaves Bruce Lee reeling in the fifth round! This fight is far from over, but Darius has undeniably seized.",
      "defenseCommentary": "Blackwood's on edge in round 5, but his Ironclad Fortitude is a bulwark against Lee's relentless pressure. Can he weather this onslaught and launch a counter.",
      "attackerDamage": 48,
      "defenderDamage": 0,
      "randomEvent": "Darius Blackwood uses undefined in their attack!",
      "arenaObjectsUsed": [
        null
      ],
      "healthAfter": {
        "attacker": 56,
        "defender": 0
      }
    }
  ]
}