{
  "metadata": {
    "timestamp": "2025-07-14T08:54:18.807Z",
    "fighterA": {
      "name": "Darth Vader",
      "imageUrl": "/vs/fighters/Darth-1-1752482990295-dwnufg.jpg",
      "stats": {
        "health": 96,
        "maxHealth": 96,
        "strength": 36,
        "luck": 24,
        "agility": 65,
        "defense": 19,
        "age": 18,
        "size": "medium",
        "build": "average"
      },
      "description": "a stark, obsidian chamber dominates the scene. the walls are smooth and featureless save for a single, immense steel door at the far end. a low pedestal stands in the center of the room, upon which rests a complex, pulsating energy core - emitting a faint blue light. steel door energy core pedestal worn leather armor darth vader menacing and powerful, radiating an aura of cold authority and impending doom. the energy core is disrupting the chamber's stability, causing tremors. a faint holographic projection flickers briefly near darth vader’s helmet."
    },
    "fighterB": {
      "name": "Victor Martel",
      "imageUrl": "/vs/fighters/Stephen-Siegal-1752483028216-92m45n.jpg",
      "stats": {
        "health": 120,
        "maxHealth": 120,
        "strength": 45,
        "luck": 18,
        "agility": 60,
        "defense": 30,
        "age": 35,
        "size": "medium",
        "build": "muscular"
      },
      "description": "a dimly lit tavern interior, filled with the murmur of conversations and the clinking of glasses. rough-hewn wooden tables are scattered across a worn floor. tapestries depicting stylized dragons adorn the walls. the air smells of ale, sweat, and spices. empty tankard worn leather map dice set silver coin victor martel bartender gritty and cynical, with a hint of underlying tension. the atmosphere is one of weary travelers and shady dealings. victor has a coded message hidden within his sleeve. a shadowy figure observes victor from the corner."
    },
    "arena": {
      "name": "Arena",
      "imageUrl": "/vs/arena/Marbella-Marina-1752483054142-ypvf52.webp",
      "description": ""
    },
    "winner": "Darth Vader",
    "totalRounds": 6,
    "maxRounds": 6
  },
  "battleLog": [
    {
      "round": 1,
      "attacker": "Darth Vader",
      "defender": "Victor Martel",
      "attackCommentary": "Martel dives in with a risky uppercut as Vader desperately blocks! The connection is clean for 14 damage, leaving the dark lord staggering but determined to stay in this fight.",
      "defenseCommentary": "Darth Vader blocks the strike with expert timing!",
      "attackerDamage": 14,
      "defenderDamage": 0,
      "randomEvent": "",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 96,
        "defender": 106
      }
    },
    {
      "round": 2,
      "attacker": "Victor Martel",
      "defender": "Darth Vader",
      "attackCommentary": "Martel goes on the offensive with a flurry of precise strikes! A crucial 23-point connection leaves Vader reeling in Round 2 - will he recover.",
      "defenseCommentary": "Martel dances out of Vader's relentless saber onslaught in a flurry of parries and precise steps. Can he maintain this pressure point assault on the exhausted Dark Lord to secure.",
      "attackerDamage": 23,
      "defenderDamage": 0,
      "randomEvent": "",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 106,
        "defender": 73
      }
    },
    {
      "round": 3,
      "attacker": "Darth Vader",
      "defender": "Victor Martel",
      "attackCommentary": "Martel dances back from a Force choke attempt, landing a quick combo that leaves Vader reeling with a decisive 27 damage! Can he maintain this pressure in the climactic round.",
      "defenseCommentary": "Martel dances out of Vader's aggressive blade flurry, showcasing his unmatched evasiveness as pressure mounts. This could be a turning point.",
      "attackerDamage": 27,
      "defenderDamage": 0,
      "randomEvent": "",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 73,
        "defender": 79
      }
    },
    {
      "round": 4,
      "attacker": "Victor Martel",
      "defender": "Darth Vader",
      "attackCommentary": "Martel lands a flurry of precise jabs against Vader's defenses in a desperate attempt to exploit a momentary opening. Can he outmaneuver the dark lord and finally take control of.",
      "defenseCommentary": "Martel dances on the edge of Vader's Force-enhanced reach in a desperate sidestep! This round hinges on his calculated defense as he avoids that lethal spinning lightsaber.",
      "attackerDamage": 0,
      "defenderDamage": 0,
      "randomEvent": "Darth Vader successfully dodges the attack!",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 79,
        "defender": 73
      }
    },
    {
      "round": 5,
      "attacker": "Darth Vader",
      "defender": "Victor Martel",
      "attackCommentary": "Martel dances through Vader's initial flurry, landing a precise counter with his speed. 15 damage into the Lord of the Sith! Can he maintain this pressure?  The crowd is.",
      "defenseCommentary": "Vader's Force choke is deflected by Martel's expert bladework in a tense defensive showcase. This 5th round edge belongs to anticipation as neither fighter falters.",
      "attackerDamage": 15,
      "defenderDamage": 0,
      "randomEvent": "",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 73,
        "defender": 64
      }
    },
    {
      "round": 6,
      "attacker": "Victor Martel",
      "defender": "Darth Vader",
      "attackCommentary": "Martel goes on high offense in round 6 with a lightning-fast combo! Can Vader weather this onslaught of blade fury and turn it back on the relentless duelist.",
      "defenseCommentary": "Martel dances on the edge of Vader's reach in a desperate counterpoint to the onslaught! Can he weather this final flurry and claim a comeback victory.",
      "attackerDamage": 0,
      "defenderDamage": 0,
      "randomEvent": "Darth Vader successfully dodges the attack!",
      "arenaObjectsUsed": [],
      "healthAfter": {
        "attacker": 64,
        "defender": 73
      }
    }
  ]
}