{
  "metadata": {
    "timestamp": "2025-07-13T10:52:53.846Z",
    "fighterA": {
      "name": "Test Fighter",
      "imageUrl": "/vs/fighters/test-fighter-1752395650080-l2c3ei.jpg",
      "stats": {
        "health": 100,
        "maxHealth": 100,
        "strength": 10,
        "luck": 5,
        "agility": 8,
        "defense": 3,
        "age": 30,
        "size": "medium",
        "build": "average"
      },
      "description": ""
    },
    "fighterB": {
      "name": "Godzilla",
      "imageUrl": "/vs/fighters/download (3)-1752403924268-3img0b.jpg",
      "stats": {
        "health": 51,
        "maxHealth": 51,
        "strength": 4,
        "luck": 14,
        "agility": 20,
        "defense": 8,
        "age": 5,
        "size": "small",
        "build": "average"
      },
      "description": "a volcanic wasteland stretches to the horizon, dominated by a colossal, active volcano spewing ash and molten rock. scorched earth twisted metal wreckage geothermal vents massive footprints godzilla (adult) scattered robotic drones chaotic and terrifying; a sense of overwhelming power and destruction. a faint, rhythmic pulsing emanates from the volcano's peak. the robotic drones appear to be damaged but still functional, possibly guarding something."
    },
    "arena": {
      "name": "Arena",
      "imageUrl": "/vs/arena/scene-castle-1-1752403946540-jav0g9.jpg",
      "description": "a weathered stone castle dominates the scene, situated on a small island connected to the mainland by a long, wooden causeway. the water surrounding the castle is calm and reflects the overcast sky. the architecture appears medieval, with tall towers and thick walls suggesting defensive fortifications. a shadow stretches from one of the towers across the causeway. wooden causeway stone castle walls towers water quiet and imposing, with a sense of history and potential danger. the atmosphere is still and somewhat melancholic. a single raven perches atop the highest tower. scratches mar the stone near the castle gate."
    },
    "winner": "Godzilla",
    "totalRounds": 4,
    "maxRounds": 6
  },
  "battleLog": [
    {
      "round": 1,
      "attacker": "Test Fighter",
      "defender": "Godzilla",
      "attackCommentary": "Test Fighter opens with a decisive strike, landing a solid 8 damage on Godzilla in their first exchange! This early aggression could shake up the King of Monsters' usual pattern.",
      "defenseCommentary": "Test Fighter dodges and counters with precision!",
      "attackerDamage": 8,
      "defenderDamage": 0,
      "randomEvent": null,
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 100,
        "defender": 43
      }
    },
    {
      "round": 2,
      "attacker": "Godzilla",
      "defender": "Test Fighter",
      "attackCommentary": "Test Fighter lands a desperate shot on Godzilla's atomic breath barrier! It'll take more than that to fell this BEAST of BURDEN in Round 2.",
      "defenseCommentary": "The flames of Godzilla's atomic breath lick at Test Fighter, but they expertly sidestep every blast in a desperate flurry of defensive maneuvers. This round belongs to pure evasiveness.",
      "attackerDamage": 2,
      "defenderDamage": 0,
      "randomEvent": "Godzilla narrowly dodges Test Fighter's attack!",
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 43,
        "defender": 98
      }
    },
    {
      "round": 3,
      "attacker": "Test Fighter",
      "defender": "Godzilla",
      "attackCommentary": "Test Fighter lands a solid combo, driving Godzilla back with an unexpected 8 points of damage! Can he maintain this pressure in the final round.",
      "defenseCommentary": "Test Fighter dances on the edge of Godzilla's atomic breath in round 3, narrowly avoiding a full-screen annihilation with lightning reflexes and a defiant smirk.  This calculated defense might.",
      "attackerDamage": 8,
      "defenderDamage": 0,
      "randomEvent": null,
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 98,
        "defender": 35
      }
    },
    {
      "round": 4,
      "attacker": "Godzilla",
      "defender": "Test Fighter",
      "attackCommentary": "Godzilla explodes forward with a bone-jarring atomic blast, landing CLEAN on Test Fighter for a monstrous 98 damage in round four! The pressure is mounting!  We're seeing if this.",
      "defenseCommentary": "The pressure's on as Test Fighter tries to weather Godzilla's atomic onslaught in this crucial Round 4! Can they hold out, or will another devastating blast end their hopes.",
      "attackerDamage": 98,
      "defenderDamage": 0,
      "randomEvent": "Godzilla fails to dodge and is knocked out!",
      "arenaObjectsUsed": null,
      "healthAfter": {
        "attacker": 35,
        "defender": 0
      }
    }
  ]
}